ams/src/Documents/_ВозвратИзПереработки/_ВозвратИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ВозвратИзПереработки</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister._ТоварыПереданные</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/AMS_ТоварыВПереработку/AMS_ТоварыВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AMS_ТоварыВПереработку</name>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/AccumulationRegisters/_ТоварыПереданные/_ТоварыПереданные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>_ТоварыПереданные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef._ВозвратИзПереработки</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ams/src/Documents/_ВозвратИзПереработки/Forms/Подбор/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	АдресВХранилище = Неопределено;
	Если Параметры.Свойство("АдресВХранилище", АдресВХранилище) Тогда
		Данные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	КонецЕсли;

	КонтрагентНаименование = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Данные.Контрагент, "Наименование");

	Если КонтрагентНаименование = "Эстервуд" Тогда
		ЗаполнитьТаблицуПодбораСырья(Данные);
	Иначе
		ЗаполнитьТаблицуПодбораПреформ(Данные);
	КонецЕсли;

	КоличествоСтрок = Товары.Количество();
	Элементы.Товары.Высота = КоличествоСтрок + 1;
	Высота = КоличествоСтрок + 5;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Данные были изменены. Перенести изменения в документ?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокументВыполнить()
	ПеренестиТоварыВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуПодбораПреформ(Данные)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Данные.Товары);
	Запрос.УстановитьПараметр("Дата", Данные.Дата);
	Запрос.УстановитьПараметр("Склад", Данные.Склад);
	Запрос.УстановитьПараметр("Контрагент", Данные.Контрагент);

	Запрос.Текст =
	"ВЫБРАТЬ
	|   таб.Номенклатура
	|ПОМЕСТИТЬ тов
	|ИЗ
	|   РегистрСведений.AMS_ТоварыВПереработку КАК таб
	|ГДЕ
	|   таб.Контрагент = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   Товары.Номенклатура,
	|   Товары.Количество
	|ПОМЕСТИТЬ док
	|ИЗ
	|   &Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   ТоварыПереданныеОстатки.Номенклатура,
	|   ТоварыПереданныеОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ост
	|ИЗ
	|   РегистрНакопления._ТоварыПереданные.Остатки(&Дата, Контрагент = &Контрагент) КАК ТоварыПереданныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   тов.Номенклатура,
	|   ост.КоличествоОстаток КАК ВПереработке,
	|   док.Количество
	|ИЗ
	|   тов КАК тов
	|       ЛЕВОЕ СОЕДИНЕНИЕ ост КАК ост
	|       ПО тов.Номенклатура = ост.Номенклатура
	|       ЛЕВОЕ СОЕДИНЕНИЕ док КАК док
	|       ПО тов.Номенклатура = док.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|   тов.Номенклатура.Наименование";

	Результат = Запрос.Выполнить();
	Товары.Загрузить(Результат.Выгрузить());

	Элементы.ТоварыОстатокНаСкладе.Заголовок = "Остаток на " + Данные.Дата;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПодбораСырья(Данные)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция", Справочники.Номенклатура.НайтиПоКоду("01-0002396"));
	Запрос.УстановитьПараметр("Товары", Данные.Товары);
	Запрос.УстановитьПараметр("Дата", Данные.Дата);
	Запрос.УстановитьПараметр("Склад", Данные.Склад);
	Запрос.УстановитьПараметр("Контрагент", Данные.Контрагент);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Владелец = &Продукция
	|	И НЕ д.ПометкаУдаления
	|	И д.Основной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество
	|ПОМЕСТИТЬ док
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ост
	|ИЗ
	|	РегистрНакопления._ТоварыПереданные.Остатки(&Дата, Контрагент = &Контрагент) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	ост.КоличествоОстаток КАК ВПереработке,
	|	док.Количество КАК Количество
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ост КАК ост
	|		ПО тов.Номенклатура = ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ док КАК док
	|		ПО тов.Номенклатура = док.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	тов.Номенклатура.Наименование";

	Результат = Запрос.Выполнить();
	Товары.Загрузить(Результат.Выгрузить());

	Элементы.ТоварыОстатокНаСкладе.Заголовок = "Остаток на " + Данные.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыВДокумент()
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Массив = Новый Массив;

	Для Каждого Стр Из Товары Цикл
		Если Стр.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		Массив.Добавить(Новый Структура("Номенклатура,Количество", Стр.Номенклатура, Стр.Количество));
	КонецЦикла;

	Закрыть(Массив);
КонецПроцедуры
#КонецОбласти
